examples/wire/0/air/T
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class volScalarField;
 location "0/air";
 object T;
}

dimensions [ 0 0 0 1 0 0 0 ];

internalField uniform 277.15;

boundaryField
{
  inlet
  {
    type fixedValue;
    value uniform 277.15;
  }
  outlet
  {
    type inletOutlet;
    inletValue uniform 277.15;
    value $internalField;
  }
  top_bottom
  {
    type zeroGradient;
  }
  air_to_solution1
  {
    type regionCoupleTemperature;
    neighbourRegionName solution1;
    neighbourPatchName solution_to_air;
    neighbourFieldName T;
    relaxationFactor 0.5;
    value uniform 276.15;
  }
  air_to_solution2
  {
    type regionCoupleTemperature;
    neighbourRegionName solution2;
    neighbourPatchName solution_to_air;
    neighbourFieldName T;
    relaxationFactor 0.5;
    value uniform 276.15;
  }
  wire
  {
    type zeroGradient;
  }
  wall
  {
    type zeroGradient;
  }
  symmetry
  {
    type symmetry;
  }
} 	// ************************************************************************* //

