examples/wire/0/air/cw
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class volScalarField;
 location "0/air";
 object cw;
}

dimensions [ 0 0 0 0 0 0 0 ];

internalField uniform 0.004074222634562929;

boundaryField
{
  inlet
  {
    type fixedValue;
    value uniform 0.004074222634562929;
  }
  outlet
  {
    type inletOutlet;
    value $internalField;
    inletValue uniform 0.004074222634562929;
  }
  top_bottom
  {
    type zeroGradient;
  }
  air_to_solution1
  {
    type regionCoupleVaporPressure;
    neighbourRegionName solution1;
    neighbourPatchName solution_to_air;
    neighbourFieldName pw;
    relaxationFactor 0.5;
    value $internalField;
  }
  air_to_solution2
  {
    type regionCoupleVaporPressure;
    neighbourRegionName solution2;
    neighbourPatchName solution_to_air;
    neighbourFieldName pw;
    relaxationFactor 0.5;
    value $internalField;
  }
  wire
  {
    type zeroGradient;
  }
  wall
  {
    type zeroGradient;
  }
  symmetry
  {
    type symmetry;
  }
} 	// ************************************************************************* //

