examples/wire/0/solution1/U
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class volVectorField;
 location "0";
 object U;
}

dimensions [ 0 1 -1 0 0 0 0 ];

internalField uniform (0 0 0);

boundaryField
{
  inlet
  {
    type flowRateInletVelocity;
    volumetricFlowRate constant         1.5216031107764158e-06 ;
    value uniform (0 0 0);
  }
  outlet
  {
    type zeroGradient;
    value uniform (0 0 0.0265);
  }
  wall
  {
    type noSlip;
  }
  front_back
  {
    type zeroGradient;
  }
  solution_to_air
  {
    type zeroGradient;
  }
} 	// ************************************************************************* //

