examples/wire/0/solution1/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0; 

boundaryField
{
    inlet
    {
      type zeroGradient;
    }
    outlet
    {
      type fixedValue;
      value uniform 0;
    }
    wall
    {
      type zeroGradient;
    }
    front_back
    {
      type zeroGradient;
    }
    solution_to_air
    {
      type zeroGradient;
    }
}


// ************************************************************************* //
