examples/wire/0/solution2/cw
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class volScalarField;
 location "0/solution";
 object cw;
}

dimensions [ 0 0 0 0 0 0 0 ];

internalField uniform 0.2;

boundaryField
{
  inlet
  {
    type fixedValue;
    value uniform 0.2;
  }
  outlet
  {
    type zeroGradient;
    value $internalField;
  }
  wall
  {
    type zeroGradient;
  }
  front_back
  {
    type zeroGradient;
  }
  solution_to_air
  {
    type regionCoupleMassFluxPicard;
    neighbourRegionName air;
    neighbourPatchName air_to_solution2;
    neighbourFieldName cw;
    value $internalField;
  }
} 	// ************************************************************************* //

