examples/wire/0/solution2/pw
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class volScalarField;
 location "0/solution";
 object pw;
}

dimensions [ 1 -1 -2 0 0 0 0 ];

internalField uniform 375.6448249245479;

boundaryField
{
  inlet
  {
    type calculated;
    value $internalField;
  }
  outlet
  {
    type calculated;
    value $internalField;
  }
  wall
  {
    type calculated;
    value $internalField;
  }
  front_back
  {
    type calculated;
    value $internalField;
  }
  solution_to_air
  {
    type calculated;
    value $internalField;
  }
} 	// ************************************************************************* //

