examples/wire/constant/solution1/thermophysicalProperties
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 object thermophysicalProperties;
}

mixture
{
  equationOfState
  {
    rho rho         [ 1 -3 0 0 0 0 0 ]         1114.90161382935 ;
  }
  transport
  {
    flagMedium 0;
    lambda lambda         [ 1 1 -3 -1 0 0 0 ]         0.31382435347142856 ;
    TDiff TDiff         [ 0 2 -1 0 0 0 0 ]         1.152065436504351e-07 ;
    cwDiff cwDiff         [ 0 2 -1 0 0 0 0 ]         8.34e-11 ;
    p0 p0         [ 1 -1 -2 0 0 0 0 ]         100000.0 ;
    nu nu [ 0 2 -1 0 0 0 0 ] 9.061427650757481e-05;
  }
  vaporPressureFit
  {
    k0A k0A         [ 0 0 0 0 0 0 0 ]         3.05470360e+01 ;
    k1A k1A         [ 0 0 0 0 0 0 0 ]         -2.50979099e+01 ;
    k2A k2A         [ 0 0 0 0 0 0 0 ]         1.49205640e-02 ;
    k3A k3A         [ 0 0 0 0 0 0 0 ]         0 ;
    k0B k0B         [ 0 0 0 1 0 0 0 ]         3.16015087e+04 ;
    k1B k1B         [ 0 0 0 1 0 0 0 ]         -5.97075816e+04 ;
    k2B k2B         [ 0 0 0 1 0 0 0 ]         2.84074542e+04 ;
    k3B k3B         [ 0 0 0 1 0 0 0 ]         0 ;
    k0C k0C         [ 0 0 0 1 0 0 0 ]         8.70854761e+02 ;
    k1C k1C         [ 0 0 0 1 0 0 0 ]         -1.12448663e+03 ;
    k2C k2C         [ 0 0 0 1 0 0 0 ]         0 ;
    k3C k3C         [ 0 0 0 1 0 0 0 ]         0 ;
    D D         [ 1 -1 -2 0 0 0 0 ]             0 ;
  }
}



// ************************************************************************* //
