examples/wire/system/solution2/blockMeshDict
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 object blockMeshDict;
}

vertices
  (
  ); 

edges
  (
  );

blocks
  (
  ); 

boundary
  (
  );

mergePatchPairs
  (
  ); 	
// ************************************************************************* //

